[
  {
    "link": "https://uxplanet.org/the-details-that-matter-8b962ca58b49?source=---------0-----------",
    "pic": "https://cdn-images-1.medium.com/fit/c/36/36/1*ftnOlIAh5nolCvvrhc44-Q.png",
    "author": "",
    "date": "3 days ago",
    "photo": "https://cdn-images-1.medium.com/max/800/1*xv6xhcRljayCKY15LDekfQ.png",
    "head": "The Details That Matter",
    "contents": "Your product’s success is based on a combination of factors, but the overall user experience tops them all. When it comes down to designing a new app or a site, sticking to best practices is a solid way to go, but during the creation of the big picture, it’s fairly easy to skimp over design elements that feel like nice to have but not necessary. However, the difference between good and bad experiences often comes down to how thoughtful we can design these small details.In this article, I’ll focus on visual feedback, microcopy and whitespace and you’ll see why these little big details are just as important as the more obvious elements of your design, and how they help determine the success of your product.Visual feedback might be easily overlooked in the greater design scheme, but it actually hold the entire experience together. When there’s no feedback there’s no proper interaction. Imagine talking to someone who doesn’t respond in any way — you can’t communicate at all. Same goes for your app.You must ensure that there is always some feedback for user actions, because it makes users feel in control. Visual feedbackIn real life, buttons, controls and objects respond to our interaction, and this is how people expect things to work. People expect a similar level of responsiveness from app elements.Visual feedback is also helpful when you need to inform users about results of an operation. You can use existing elements to deliver a feedback.Users want to know their current context in a system at any given time and apps shouldn’t keep them guessing — they should tell the user what’s happening via appropriate visual feedback. For frequent and minor actions, the response can be modest, while for infrequent and major actions, the response should be more substantial.Microcopy is the little bits of text that guide users through an experience. Microcopy examples are error messages, button labels, hint text. At a glance, these tiny clusters of words seem insignificant when compared to the overall app design. But surprisingly, they have a huge impact on conversions.A quick way to make your UI warmer and less mechanical is a human tone in the copy. If your product sounds human, it’s easier for people to trust you.How errors are communicated can have a huge impact on the way someone experiences your product. Often overlooked, an ill-constructed error message can fill users with frustration.A well-crafted error message, on the other hand, can turn a moment of frustration into a moment of delight. Thus, make error messages human, not technical, and suited to your audience.Microcopy is extremely contextual. That’s why it’s so valuable. It answers a very specific question people have and speaks to their concerns right on the spot. For example, microcopy can be fundamental in reassuring your users at the point of subscribing or sharing details. Whilst ‘not to spam/auto-tweet’ might be taken for granted by good marketers when asking for email address/access to the social network account connections, the user is less than sure. Thus, when people add their emails or connect their Twitter accounts, say “we hate spam as much as you do.”Whitespace (or negative space) is the areas of a design where there is no element placed by a designer. Elements of whitespace are space around images, margins, paddings, line-spacing and letter-spacing within text content. Although many may consider it a waste of valuable screen estate, whitespace is an essential element in user interface design.Clutter is bad. Cluttering your interface overloads your user with too much information: every added button, image, and line of text make the screen more complicated. If you don’t think any part of your design should be intentionally blank, take a look at example below and you’ll see what happens when too many objects competing for your attention.The power of white space comes from the limits of human attention and memory. Our short-term memory can hold a small amount of information (typically around 7 items or even less) in mind in an active, readily-available state for a short period of time (typically from 10 to 15 seconds, or sometimes up to a minute).If cluttering your interface overloads your user with too much information, then reducing the clutter will improve comprehension. Generous whitespace can make some of the messiest interfaces look inviting and simple. Whitespace reduces the amount of elements users see all at once and makes scanning much easier. The skill of using whitespace lies in providing your users with a digestible amount of content (chunks of content), then stripping away extraneous details.Whitespace creates the spaces around elements in the design to help them stand out or separate from the other elements. It helps communicate what’s most important and needs attention.Google Search homepage is a great example of using whitespace. The layout immediately facilitates the user goal by placing primary interaction element (search box) in front and center, with plenty of white space on either side to add emphasis.The law of proximity describes how the human eye perceives connections between visual elements. It states that objects near to each other appear similar. We can use whitespace to build perceived relationships between different elements. Take a look at this picture. Almost everyone sees two groups of dots, rather than simply 16 dots.Breaking the information up into appropriate groups can help make it feel more scannable and readable. In the form on the right, categorising the 15 fields into three groups makes the process feel easier. The amount of content is the same, but the impression on users is much different.Design with care. Each minor detail in your app’s UI deserves close attention because UX is the sum of all details working harmoniously:Thank you!Follow UX Planet: Twitter | FacebookOriginally published at babich.biz"
  },
  {
    "link": "https://medium.com/uber-design/uber-navigation-f662e7611f3?source=---------1-----------",
    "pic": "https://cdn-images-1.medium.com/fit/c/36/36/1*BKWSEsJYXZy7TDFhv2yPCA.jpeg",
    "author": "Nick Babich",
    "date": "Mar 15",
    "photo": "https://cdn-images-1.medium.com/max/800/1*xpXF0yuKlzkce1hPSrqxdw.gif",
    "head": "Uber Navigation",
    "contents": "Your product’s success is based on a combination of factors, but the overall user experience tops them all. When it comes down to designing a new app or a site, sticking to best practices is a solid way to go, but during the creation of the big picture, it’s fairly easy to skimp over design elements that feel like nice to have but not necessary. However, the difference between good and bad experiences often comes down to how thoughtful we can design these small details.In this article, I’ll focus on visual feedback, microcopy and whitespace and you’ll see why these little big details are just as important as the more obvious elements of your design, and how they help determine the success of your product.Visual feedback might be easily overlooked in the greater design scheme, but it actually hold the entire experience together. When there’s no feedback there’s no proper interaction. Imagine talking to someone who doesn’t respond in any way — you can’t communicate at all. Same goes for your app.You must ensure that there is always some feedback for user actions, because it makes users feel in control. Visual feedbackIn real life, buttons, controls and objects respond to our interaction, and this is how people expect things to work. People expect a similar level of responsiveness from app elements.Visual feedback is also helpful when you need to inform users about results of an operation. You can use existing elements to deliver a feedback.Users want to know their current context in a system at any given time and apps shouldn’t keep them guessing — they should tell the user what’s happening via appropriate visual feedback. For frequent and minor actions, the response can be modest, while for infrequent and major actions, the response should be more substantial.Microcopy is the little bits of text that guide users through an experience. Microcopy examples are error messages, button labels, hint text. At a glance, these tiny clusters of words seem insignificant when compared to the overall app design. But surprisingly, they have a huge impact on conversions.A quick way to make your UI warmer and less mechanical is a human tone in the copy. If your product sounds human, it’s easier for people to trust you.How errors are communicated can have a huge impact on the way someone experiences your product. Often overlooked, an ill-constructed error message can fill users with frustration.A well-crafted error message, on the other hand, can turn a moment of frustration into a moment of delight. Thus, make error messages human, not technical, and suited to your audience.Microcopy is extremely contextual. That’s why it’s so valuable. It answers a very specific question people have and speaks to their concerns right on the spot. For example, microcopy can be fundamental in reassuring your users at the point of subscribing or sharing details. Whilst ‘not to spam/auto-tweet’ might be taken for granted by good marketers when asking for email address/access to the social network account connections, the user is less than sure. Thus, when people add their emails or connect their Twitter accounts, say “we hate spam as much as you do.”Whitespace (or negative space) is the areas of a design where there is no element placed by a designer. Elements of whitespace are space around images, margins, paddings, line-spacing and letter-spacing within text content. Although many may consider it a waste of valuable screen estate, whitespace is an essential element in user interface design.Clutter is bad. Cluttering your interface overloads your user with too much information: every added button, image, and line of text make the screen more complicated. If you don’t think any part of your design should be intentionally blank, take a look at example below and you’ll see what happens when too many objects competing for your attention.The power of white space comes from the limits of human attention and memory. Our short-term memory can hold a small amount of information (typically around 7 items or even less) in mind in an active, readily-available state for a short period of time (typically from 10 to 15 seconds, or sometimes up to a minute).If cluttering your interface overloads your user with too much information, then reducing the clutter will improve comprehension. Generous whitespace can make some of the messiest interfaces look inviting and simple. Whitespace reduces the amount of elements users see all at once and makes scanning much easier. The skill of using whitespace lies in providing your users with a digestible amount of content (chunks of content), then stripping away extraneous details.Whitespace creates the spaces around elements in the design to help them stand out or separate from the other elements. It helps communicate what’s most important and needs attention.Google Search homepage is a great example of using whitespace. The layout immediately facilitates the user goal by placing primary interaction element (search box) in front and center, with plenty of white space on either side to add emphasis.The law of proximity describes how the human eye perceives connections between visual elements. It states that objects near to each other appear similar. We can use whitespace to build perceived relationships between different elements. Take a look at this picture. Almost everyone sees two groups of dots, rather than simply 16 dots.Breaking the information up into appropriate groups can help make it feel more scannable and readable. In the form on the right, categorising the 15 fields into three groups makes the process feel easier. The amount of content is the same, but the impression on users is much different.Design with care. Each minor detail in your app’s UI deserves close attention because UX is the sum of all details working harmoniously:Thank you!Follow UX Planet: Twitter | FacebookOriginally published at babich.bizY ou sit in your car, listening to a light rain ping quietly down on the hood. You’ve just finished your fourth trip of the night, and you sit back and relax. Not for long though, it’s a busy night and you accept another pickup request close by. As navigation begins, you check your mirrors, shift into drive, and pull out onto the road towards a new destination. You work your way across a few lanes of heavy traffic to make that first left coming up. After more lights and turns, you arrive at a busy pickup point and look for a safe space to pull over. Out of the crowd on the sidewalk, a person waves and heads your way.You’re about to find out where you’re going next.On the driver team at Uber, one of our jobs is to take the pressure off of drivers, so that they can focus on smooth and stress-free rides for everybody. We want to make sure that drivers have the best features possible directly in-app, and one of the most important features is a navigation system. So we started with a basic question:If you’re browsing for a new restaurant for lunch, or trying to find a lecture hall on a college campus, you’ll have different mapping needs than if you’re in the mountains on a two-day hike. And, if you’re commuting to work on a familiar daily route, or driving to a friend’s birthday party, your navigation needs are different from people driving with Uber. Why are one-size-fits-all digital maps not a good fit for Uber?It all boils down to this:For most drivers in most situations, your trip is a simple one: you’ve got a starting point, a destination, and the best route between the two. The end.If you’re driving with Uber, however, it’s all about that magic moment where a car and a passenger meet. Then you travel together to a new destination, and when your passenger leaves your car, you’re off to the next meeting point. If you are a driver on an uberPool trip, your route might have several overlapping pickups and dropoffs. Throw deliveries into the mix — where you might need to park and walk inside for a pickup — and navigation can get incredibly complicated.When it came to something as central as navigation, we knew how important it was to get things right. Uber is able to move fast with features, but for the navigation overhaul, our pace was much more deliberate.Committing to the long haul meant that we could dive deeply into the needs of drivers. We conducted driver interviews. We rode along with them to watch and listen to their pain points. We held in-office forums and gathered map and navigation related feedback. We shared prototypes, observed drivers interacting with them, and listened to their likes and dislikes. We set up an eye-tracking rig and analyzed how a driver’s eyes interact with the environment vs. a device screen. We built a car simulator in our office, which we connected to a gaming wheel controller, a video of typical driving scenarios, and a timed navigation prototype. We even built a physical map of Amsterdam out of paper.But we didn’t stop there. We sent our team across the US and all over the world with navigation prototypes and cameras to see what would happen when rubber met the road.It’s hard to overstate how valuable this first-person testing was. We understood that we needed a mapping + navigation tool that would be as useful over the canals of Amsterdam and through the tunnels of Boston as it would in the jammed streets of Jakarta or the one-way avenues of NYC. Day or night, uberX or uberPOOL, it needed to serve the unique needs of drivers.Unlike traditional navigation apps, Uber Navigation has to help its users answer the question “What’s next?”. Once a driver successfully completes one trip, it’s important that navigation is ready with the best route for the next trip.Uber Navigation also needs to differentiate between types of locations and activities, so we designed distinct visuals for the variety of actions a driver might take on different legs of a trip. Custom cartography, maneuver iconography, pins, side-of-street-indicators, route line previews, and camera animations all work together to explain the journey.Take the “3-Foot-1-Second” Rule: drivers are looking at a smartphone-sized screen from about three feet away, for about one second at a time. This means that “glanceability” and “tappability” are priorities. Designing the new navigation experience was all about answering the question “what is the essential information that the user needs right now?” Everything else had to take a backseat.For gestures, we wanted drivers to have freedom, but also minimal need to interact while driving. We do enable a driver to pan and zoom if they choose, but we also made sure to build in an effortless single tap gesture to toggle between an overview state and a first person navigation, or to inspect the destination point.One of our essential new navigation features is Night Mode. Many people drive with Uber at night, and sometimes for hours at a time. The default day settings can cause eye-strain as a driver readjusts from the bright screen to the dark streets outside. Night Mode protects drivers from light pollution that would otherwise be a real ergonomic and safety hazard.For Night Mode, we wanted a subdued color palette. Designers sat in a windowless, dark room and analyzed multiple color schemes. We were amazed by how different they looked in an unlit room compared to a normal bright conference room. We took our favorite options out on night-time drive tests, and from there we pushed and pulled values until the guidance UI, map UI, and map styles all felt harmonious.Uber Navigation is custom tailored for drivers, and we’re not done yet. Every day we’re collecting great constructive feedback from drivers, and we’ll be prioritizing their feedback in upcoming versions. Plus, now that we’ve rolled out our starting lineup, we’re excited for all of the design possibilities to come.We are so proud of everyone who made this happen. And while this post is design-focused, we want to recognize over a year of hard work by designers, engineers, researchers, and product managers. Most of all, we’d like to thank the drivers for their invaluable feedback. Thank you!Are you a map design enthusiast, routing wonk, driver? Have any thoughts about the new navigation? Let us know what you think in the comments below!ByEvelyn KimCady WachsmanChristine TaoBo Paweena AttayadmawittayaMap data source © TomTom"
  },
  {
    "link": "https://medium.muz.li/best-design-advice-no-one-ever-gave-me-92acf6b0858a?source=---------2-----------",
    "pic": "https://cdn-images-1.medium.com/fit/c/36/36/1*Y25EVwM-Uy-DpA27F1PwzQ.jpeg",
    "author": "",
    "date": "Mar 17",
    "photo": "https://cdn-images-1.medium.com/max/1000/1*LwSKN80sJ_nZ-a-lJXyMkQ.jpeg",
    "head": "Best Design Advice No One Ever Gave Me",
    "contents": "Your product’s success is based on a combination of factors, but the overall user experience tops them all. When it comes down to designing a new app or a site, sticking to best practices is a solid way to go, but during the creation of the big picture, it’s fairly easy to skimp over design elements that feel like nice to have but not necessary. However, the difference between good and bad experiences often comes down to how thoughtful we can design these small details.In this article, I’ll focus on visual feedback, microcopy and whitespace and you’ll see why these little big details are just as important as the more obvious elements of your design, and how they help determine the success of your product.Visual feedback might be easily overlooked in the greater design scheme, but it actually hold the entire experience together. When there’s no feedback there’s no proper interaction. Imagine talking to someone who doesn’t respond in any way — you can’t communicate at all. Same goes for your app.You must ensure that there is always some feedback for user actions, because it makes users feel in control. Visual feedbackIn real life, buttons, controls and objects respond to our interaction, and this is how people expect things to work. People expect a similar level of responsiveness from app elements.Visual feedback is also helpful when you need to inform users about results of an operation. You can use existing elements to deliver a feedback.Users want to know their current context in a system at any given time and apps shouldn’t keep them guessing — they should tell the user what’s happening via appropriate visual feedback. For frequent and minor actions, the response can be modest, while for infrequent and major actions, the response should be more substantial.Microcopy is the little bits of text that guide users through an experience. Microcopy examples are error messages, button labels, hint text. At a glance, these tiny clusters of words seem insignificant when compared to the overall app design. But surprisingly, they have a huge impact on conversions.A quick way to make your UI warmer and less mechanical is a human tone in the copy. If your product sounds human, it’s easier for people to trust you.How errors are communicated can have a huge impact on the way someone experiences your product. Often overlooked, an ill-constructed error message can fill users with frustration.A well-crafted error message, on the other hand, can turn a moment of frustration into a moment of delight. Thus, make error messages human, not technical, and suited to your audience.Microcopy is extremely contextual. That’s why it’s so valuable. It answers a very specific question people have and speaks to their concerns right on the spot. For example, microcopy can be fundamental in reassuring your users at the point of subscribing or sharing details. Whilst ‘not to spam/auto-tweet’ might be taken for granted by good marketers when asking for email address/access to the social network account connections, the user is less than sure. Thus, when people add their emails or connect their Twitter accounts, say “we hate spam as much as you do.”Whitespace (or negative space) is the areas of a design where there is no element placed by a designer. Elements of whitespace are space around images, margins, paddings, line-spacing and letter-spacing within text content. Although many may consider it a waste of valuable screen estate, whitespace is an essential element in user interface design.Clutter is bad. Cluttering your interface overloads your user with too much information: every added button, image, and line of text make the screen more complicated. If you don’t think any part of your design should be intentionally blank, take a look at example below and you’ll see what happens when too many objects competing for your attention.The power of white space comes from the limits of human attention and memory. Our short-term memory can hold a small amount of information (typically around 7 items or even less) in mind in an active, readily-available state for a short period of time (typically from 10 to 15 seconds, or sometimes up to a minute).If cluttering your interface overloads your user with too much information, then reducing the clutter will improve comprehension. Generous whitespace can make some of the messiest interfaces look inviting and simple. Whitespace reduces the amount of elements users see all at once and makes scanning much easier. The skill of using whitespace lies in providing your users with a digestible amount of content (chunks of content), then stripping away extraneous details.Whitespace creates the spaces around elements in the design to help them stand out or separate from the other elements. It helps communicate what’s most important and needs attention.Google Search homepage is a great example of using whitespace. The layout immediately facilitates the user goal by placing primary interaction element (search box) in front and center, with plenty of white space on either side to add emphasis.The law of proximity describes how the human eye perceives connections between visual elements. It states that objects near to each other appear similar. We can use whitespace to build perceived relationships between different elements. Take a look at this picture. Almost everyone sees two groups of dots, rather than simply 16 dots.Breaking the information up into appropriate groups can help make it feel more scannable and readable. In the form on the right, categorising the 15 fields into three groups makes the process feel easier. The amount of content is the same, but the impression on users is much different.Design with care. Each minor detail in your app’s UI deserves close attention because UX is the sum of all details working harmoniously:Thank you!Follow UX Planet: Twitter | FacebookOriginally published at babich.bizY ou sit in your car, listening to a light rain ping quietly down on the hood. You’ve just finished your fourth trip of the night, and you sit back and relax. Not for long though, it’s a busy night and you accept another pickup request close by. As navigation begins, you check your mirrors, shift into drive, and pull out onto the road towards a new destination. You work your way across a few lanes of heavy traffic to make that first left coming up. After more lights and turns, you arrive at a busy pickup point and look for a safe space to pull over. Out of the crowd on the sidewalk, a person waves and heads your way.You’re about to find out where you’re going next.On the driver team at Uber, one of our jobs is to take the pressure off of drivers, so that they can focus on smooth and stress-free rides for everybody. We want to make sure that drivers have the best features possible directly in-app, and one of the most important features is a navigation system. So we started with a basic question:If you’re browsing for a new restaurant for lunch, or trying to find a lecture hall on a college campus, you’ll have different mapping needs than if you’re in the mountains on a two-day hike. And, if you’re commuting to work on a familiar daily route, or driving to a friend’s birthday party, your navigation needs are different from people driving with Uber. Why are one-size-fits-all digital maps not a good fit for Uber?It all boils down to this:For most drivers in most situations, your trip is a simple one: you’ve got a starting point, a destination, and the best route between the two. The end.If you’re driving with Uber, however, it’s all about that magic moment where a car and a passenger meet. Then you travel together to a new destination, and when your passenger leaves your car, you’re off to the next meeting point. If you are a driver on an uberPool trip, your route might have several overlapping pickups and dropoffs. Throw deliveries into the mix — where you might need to park and walk inside for a pickup — and navigation can get incredibly complicated.When it came to something as central as navigation, we knew how important it was to get things right. Uber is able to move fast with features, but for the navigation overhaul, our pace was much more deliberate.Committing to the long haul meant that we could dive deeply into the needs of drivers. We conducted driver interviews. We rode along with them to watch and listen to their pain points. We held in-office forums and gathered map and navigation related feedback. We shared prototypes, observed drivers interacting with them, and listened to their likes and dislikes. We set up an eye-tracking rig and analyzed how a driver’s eyes interact with the environment vs. a device screen. We built a car simulator in our office, which we connected to a gaming wheel controller, a video of typical driving scenarios, and a timed navigation prototype. We even built a physical map of Amsterdam out of paper.But we didn’t stop there. We sent our team across the US and all over the world with navigation prototypes and cameras to see what would happen when rubber met the road.It’s hard to overstate how valuable this first-person testing was. We understood that we needed a mapping + navigation tool that would be as useful over the canals of Amsterdam and through the tunnels of Boston as it would in the jammed streets of Jakarta or the one-way avenues of NYC. Day or night, uberX or uberPOOL, it needed to serve the unique needs of drivers.Unlike traditional navigation apps, Uber Navigation has to help its users answer the question “What’s next?”. Once a driver successfully completes one trip, it’s important that navigation is ready with the best route for the next trip.Uber Navigation also needs to differentiate between types of locations and activities, so we designed distinct visuals for the variety of actions a driver might take on different legs of a trip. Custom cartography, maneuver iconography, pins, side-of-street-indicators, route line previews, and camera animations all work together to explain the journey.Take the “3-Foot-1-Second” Rule: drivers are looking at a smartphone-sized screen from about three feet away, for about one second at a time. This means that “glanceability” and “tappability” are priorities. Designing the new navigation experience was all about answering the question “what is the essential information that the user needs right now?” Everything else had to take a backseat.For gestures, we wanted drivers to have freedom, but also minimal need to interact while driving. We do enable a driver to pan and zoom if they choose, but we also made sure to build in an effortless single tap gesture to toggle between an overview state and a first person navigation, or to inspect the destination point.One of our essential new navigation features is Night Mode. Many people drive with Uber at night, and sometimes for hours at a time. The default day settings can cause eye-strain as a driver readjusts from the bright screen to the dark streets outside. Night Mode protects drivers from light pollution that would otherwise be a real ergonomic and safety hazard.For Night Mode, we wanted a subdued color palette. Designers sat in a windowless, dark room and analyzed multiple color schemes. We were amazed by how different they looked in an unlit room compared to a normal bright conference room. We took our favorite options out on night-time drive tests, and from there we pushed and pulled values until the guidance UI, map UI, and map styles all felt harmonious.Uber Navigation is custom tailored for drivers, and we’re not done yet. Every day we’re collecting great constructive feedback from drivers, and we’ll be prioritizing their feedback in upcoming versions. Plus, now that we’ve rolled out our starting lineup, we’re excited for all of the design possibilities to come.We are so proud of everyone who made this happen. And while this post is design-focused, we want to recognize over a year of hard work by designers, engineers, researchers, and product managers. Most of all, we’d like to thank the drivers for their invaluable feedback. Thank you!Are you a map design enthusiast, routing wonk, driver? Have any thoughts about the new navigation? Let us know what you think in the comments below!ByEvelyn KimCady WachsmanChristine TaoBo Paweena AttayadmawittayaMap data source © TomTomThroughout life, you hear the cheesy saying, “quality over quantity.” In most situations this is good advice. Not in the design world.To be clear, this isn’t an excuse to show 10 half-assed designs. This means, instead of showing one design you believe to be perfect, show 3 great ideas. The ampersand in the title of this section is important — we’re trying to strike a balance and deliver on both.Time for a real-world example: Most projects start with a list of product requirements. The people who come up with the requirements usually have an idea of how they believe the product should look (whether they tell you or not). Quantity and quality comes into play when there are differing opinions about implementation. The best way to keep the project moving is to show at least two examples:Even if you know option 1 won’t work in your head, showing the initial design is critical. Stakeholders won’t be satisfied until they can actually see its shortcomings. Usually a mashup of the two concepts will be the final outcome, but that’s better than executing a design you disagree with.You could have the world’s best design, but if you don’t know how to explain the problem being addressed and the reason for your design decisions, the design will never get approved. Context is king when it comes to pitching your idea or concept to others.There are two easy steps that will help you give a great presentation:If all you do is show your final design without providing context, people may not understand how you arrived at your conclusion and ask you to explore various other approaches. At that point, defending your work and pointing out the flaws in their suggestions might sound more defensive than you would like.This is something that is very important to me and a major part of being in a creative profession. I always make it a priority to learn new skills (software, leadership, dev languages, etc.) — whatever I need to continue to grow as a designer.I don’t buy the excuse that people are too busy to learn, because almost everyone has some free time at some point in the day. It comes down to what you do in that free time.At my first job I learned how to write html, css and some basic js and became a “developer.” When I took my second job I learned how to make illustrations and add animations to my designs. At my current job, I’m learning how to communicate my thoughts more clearly and build prototypes to better demonstrate my designs.I never want to get to a point in my career or life, when I have the feeling that there is no more room for growth or learning. That’s why I am constantly striving to develop new skills whenever I can.Trendy words/designs/clothes, etc. are exactly that: trends. They will, without a doubt, die out and look dated (Remember skeumorphic design). I try to avoid incorporating short-lived trends whenever I can in life and in my career.Sometimes, you can get caught up trying to get more likes or favorites or whatever it may be, by following trends. I see tons of concepts with text or buttons overflowing past the background a random distance. Or I see a title that fits perfectly with the image designers chose but if any other image was used, the same layout would never work. Yet these shots have hundreds of likes…Disclaimer: I understand dribbble and other sites like it are meant to somewhat of a creative release for people. Therefore some of the work is strictly for fun and was never meant to be used in the real world. I’m not saying trying new things and exploring new styles is bad — but it’s not practical.My suggestion is to not get sucked into this. If your design helps people use your product or understand what to do and only gets 5 likes, it’s still a great design.On a semi-related note, I’ve conducted a number of interviews lately and I’ve picked up on many things throughout the process of trying to hire a fellow designer. Every time a candidate interviews with us and answers questions in buzzword after buzzword, the general consensus is they can’t communicate their reasoning and thoughts very well for why they made certain design decisions.First off, shame on you if you scrolled down to this point without reading anything else. Secondly, here are the key takeaways you should remember from the article.If you enjoyed this article hit that heart ❤️ and share it with the world 👍Thanks for taking the time to read this article, if you have any comments about it I would love to hear what you think.You can also check out my other article I wrote.Thanks to Hayley Parke and Ali Torbati for helping me make my thoughts make more sense."
  },
  {
    "link": "https://medium.com/springboard/the-7-questions-youll-be-asked-at-a-ux-design-interview-84f3214e0f29?source=---------3-----------",
    "pic": "https://cdn-images-1.medium.com/fit/c/36/36/1*ftnOlIAh5nolCvvrhc44-Q.png",
    "author": "Cady Wachsman",
    "date": "Mar 16",
    "photo": "https://cdn-images-1.medium.com/max/800/1*DEA03jKYENi9Z8jaKnMezw.png",
    "head": "The 7 Questions You’ll Be Asked at a UX Design Interview",
    "contents": "Your product’s success is based on a combination of factors, but the overall user experience tops them all. When it comes down to designing a new app or a site, sticking to best practices is a solid way to go, but during the creation of the big picture, it’s fairly easy to skimp over design elements that feel like nice to have but not necessary. However, the difference between good and bad experiences often comes down to how thoughtful we can design these small details.In this article, I’ll focus on visual feedback, microcopy and whitespace and you’ll see why these little big details are just as important as the more obvious elements of your design, and how they help determine the success of your product.Visual feedback might be easily overlooked in the greater design scheme, but it actually hold the entire experience together. When there’s no feedback there’s no proper interaction. Imagine talking to someone who doesn’t respond in any way — you can’t communicate at all. Same goes for your app.You must ensure that there is always some feedback for user actions, because it makes users feel in control. Visual feedbackIn real life, buttons, controls and objects respond to our interaction, and this is how people expect things to work. People expect a similar level of responsiveness from app elements.Visual feedback is also helpful when you need to inform users about results of an operation. You can use existing elements to deliver a feedback.Users want to know their current context in a system at any given time and apps shouldn’t keep them guessing — they should tell the user what’s happening via appropriate visual feedback. For frequent and minor actions, the response can be modest, while for infrequent and major actions, the response should be more substantial.Microcopy is the little bits of text that guide users through an experience. Microcopy examples are error messages, button labels, hint text. At a glance, these tiny clusters of words seem insignificant when compared to the overall app design. But surprisingly, they have a huge impact on conversions.A quick way to make your UI warmer and less mechanical is a human tone in the copy. If your product sounds human, it’s easier for people to trust you.How errors are communicated can have a huge impact on the way someone experiences your product. Often overlooked, an ill-constructed error message can fill users with frustration.A well-crafted error message, on the other hand, can turn a moment of frustration into a moment of delight. Thus, make error messages human, not technical, and suited to your audience.Microcopy is extremely contextual. That’s why it’s so valuable. It answers a very specific question people have and speaks to their concerns right on the spot. For example, microcopy can be fundamental in reassuring your users at the point of subscribing or sharing details. Whilst ‘not to spam/auto-tweet’ might be taken for granted by good marketers when asking for email address/access to the social network account connections, the user is less than sure. Thus, when people add their emails or connect their Twitter accounts, say “we hate spam as much as you do.”Whitespace (or negative space) is the areas of a design where there is no element placed by a designer. Elements of whitespace are space around images, margins, paddings, line-spacing and letter-spacing within text content. Although many may consider it a waste of valuable screen estate, whitespace is an essential element in user interface design.Clutter is bad. Cluttering your interface overloads your user with too much information: every added button, image, and line of text make the screen more complicated. If you don’t think any part of your design should be intentionally blank, take a look at example below and you’ll see what happens when too many objects competing for your attention.The power of white space comes from the limits of human attention and memory. Our short-term memory can hold a small amount of information (typically around 7 items or even less) in mind in an active, readily-available state for a short period of time (typically from 10 to 15 seconds, or sometimes up to a minute).If cluttering your interface overloads your user with too much information, then reducing the clutter will improve comprehension. Generous whitespace can make some of the messiest interfaces look inviting and simple. Whitespace reduces the amount of elements users see all at once and makes scanning much easier. The skill of using whitespace lies in providing your users with a digestible amount of content (chunks of content), then stripping away extraneous details.Whitespace creates the spaces around elements in the design to help them stand out or separate from the other elements. It helps communicate what’s most important and needs attention.Google Search homepage is a great example of using whitespace. The layout immediately facilitates the user goal by placing primary interaction element (search box) in front and center, with plenty of white space on either side to add emphasis.The law of proximity describes how the human eye perceives connections between visual elements. It states that objects near to each other appear similar. We can use whitespace to build perceived relationships between different elements. Take a look at this picture. Almost everyone sees two groups of dots, rather than simply 16 dots.Breaking the information up into appropriate groups can help make it feel more scannable and readable. In the form on the right, categorising the 15 fields into three groups makes the process feel easier. The amount of content is the same, but the impression on users is much different.Design with care. Each minor detail in your app’s UI deserves close attention because UX is the sum of all details working harmoniously:Thank you!Follow UX Planet: Twitter | FacebookOriginally published at babich.bizY ou sit in your car, listening to a light rain ping quietly down on the hood. You’ve just finished your fourth trip of the night, and you sit back and relax. Not for long though, it’s a busy night and you accept another pickup request close by. As navigation begins, you check your mirrors, shift into drive, and pull out onto the road towards a new destination. You work your way across a few lanes of heavy traffic to make that first left coming up. After more lights and turns, you arrive at a busy pickup point and look for a safe space to pull over. Out of the crowd on the sidewalk, a person waves and heads your way.You’re about to find out where you’re going next.On the driver team at Uber, one of our jobs is to take the pressure off of drivers, so that they can focus on smooth and stress-free rides for everybody. We want to make sure that drivers have the best features possible directly in-app, and one of the most important features is a navigation system. So we started with a basic question:If you’re browsing for a new restaurant for lunch, or trying to find a lecture hall on a college campus, you’ll have different mapping needs than if you’re in the mountains on a two-day hike. And, if you’re commuting to work on a familiar daily route, or driving to a friend’s birthday party, your navigation needs are different from people driving with Uber. Why are one-size-fits-all digital maps not a good fit for Uber?It all boils down to this:For most drivers in most situations, your trip is a simple one: you’ve got a starting point, a destination, and the best route between the two. The end.If you’re driving with Uber, however, it’s all about that magic moment where a car and a passenger meet. Then you travel together to a new destination, and when your passenger leaves your car, you’re off to the next meeting point. If you are a driver on an uberPool trip, your route might have several overlapping pickups and dropoffs. Throw deliveries into the mix — where you might need to park and walk inside for a pickup — and navigation can get incredibly complicated.When it came to something as central as navigation, we knew how important it was to get things right. Uber is able to move fast with features, but for the navigation overhaul, our pace was much more deliberate.Committing to the long haul meant that we could dive deeply into the needs of drivers. We conducted driver interviews. We rode along with them to watch and listen to their pain points. We held in-office forums and gathered map and navigation related feedback. We shared prototypes, observed drivers interacting with them, and listened to their likes and dislikes. We set up an eye-tracking rig and analyzed how a driver’s eyes interact with the environment vs. a device screen. We built a car simulator in our office, which we connected to a gaming wheel controller, a video of typical driving scenarios, and a timed navigation prototype. We even built a physical map of Amsterdam out of paper.But we didn’t stop there. We sent our team across the US and all over the world with navigation prototypes and cameras to see what would happen when rubber met the road.It’s hard to overstate how valuable this first-person testing was. We understood that we needed a mapping + navigation tool that would be as useful over the canals of Amsterdam and through the tunnels of Boston as it would in the jammed streets of Jakarta or the one-way avenues of NYC. Day or night, uberX or uberPOOL, it needed to serve the unique needs of drivers.Unlike traditional navigation apps, Uber Navigation has to help its users answer the question “What’s next?”. Once a driver successfully completes one trip, it’s important that navigation is ready with the best route for the next trip.Uber Navigation also needs to differentiate between types of locations and activities, so we designed distinct visuals for the variety of actions a driver might take on different legs of a trip. Custom cartography, maneuver iconography, pins, side-of-street-indicators, route line previews, and camera animations all work together to explain the journey.Take the “3-Foot-1-Second” Rule: drivers are looking at a smartphone-sized screen from about three feet away, for about one second at a time. This means that “glanceability” and “tappability” are priorities. Designing the new navigation experience was all about answering the question “what is the essential information that the user needs right now?” Everything else had to take a backseat.For gestures, we wanted drivers to have freedom, but also minimal need to interact while driving. We do enable a driver to pan and zoom if they choose, but we also made sure to build in an effortless single tap gesture to toggle between an overview state and a first person navigation, or to inspect the destination point.One of our essential new navigation features is Night Mode. Many people drive with Uber at night, and sometimes for hours at a time. The default day settings can cause eye-strain as a driver readjusts from the bright screen to the dark streets outside. Night Mode protects drivers from light pollution that would otherwise be a real ergonomic and safety hazard.For Night Mode, we wanted a subdued color palette. Designers sat in a windowless, dark room and analyzed multiple color schemes. We were amazed by how different they looked in an unlit room compared to a normal bright conference room. We took our favorite options out on night-time drive tests, and from there we pushed and pulled values until the guidance UI, map UI, and map styles all felt harmonious.Uber Navigation is custom tailored for drivers, and we’re not done yet. Every day we’re collecting great constructive feedback from drivers, and we’ll be prioritizing their feedback in upcoming versions. Plus, now that we’ve rolled out our starting lineup, we’re excited for all of the design possibilities to come.We are so proud of everyone who made this happen. And while this post is design-focused, we want to recognize over a year of hard work by designers, engineers, researchers, and product managers. Most of all, we’d like to thank the drivers for their invaluable feedback. Thank you!Are you a map design enthusiast, routing wonk, driver? Have any thoughts about the new navigation? Let us know what you think in the comments below!ByEvelyn KimCady WachsmanChristine TaoBo Paweena AttayadmawittayaMap data source © TomTomThroughout life, you hear the cheesy saying, “quality over quantity.” In most situations this is good advice. Not in the design world.To be clear, this isn’t an excuse to show 10 half-assed designs. This means, instead of showing one design you believe to be perfect, show 3 great ideas. The ampersand in the title of this section is important — we’re trying to strike a balance and deliver on both.Time for a real-world example: Most projects start with a list of product requirements. The people who come up with the requirements usually have an idea of how they believe the product should look (whether they tell you or not). Quantity and quality comes into play when there are differing opinions about implementation. The best way to keep the project moving is to show at least two examples:Even if you know option 1 won’t work in your head, showing the initial design is critical. Stakeholders won’t be satisfied until they can actually see its shortcomings. Usually a mashup of the two concepts will be the final outcome, but that’s better than executing a design you disagree with.You could have the world’s best design, but if you don’t know how to explain the problem being addressed and the reason for your design decisions, the design will never get approved. Context is king when it comes to pitching your idea or concept to others.There are two easy steps that will help you give a great presentation:If all you do is show your final design without providing context, people may not understand how you arrived at your conclusion and ask you to explore various other approaches. At that point, defending your work and pointing out the flaws in their suggestions might sound more defensive than you would like.This is something that is very important to me and a major part of being in a creative profession. I always make it a priority to learn new skills (software, leadership, dev languages, etc.) — whatever I need to continue to grow as a designer.I don’t buy the excuse that people are too busy to learn, because almost everyone has some free time at some point in the day. It comes down to what you do in that free time.At my first job I learned how to write html, css and some basic js and became a “developer.” When I took my second job I learned how to make illustrations and add animations to my designs. At my current job, I’m learning how to communicate my thoughts more clearly and build prototypes to better demonstrate my designs.I never want to get to a point in my career or life, when I have the feeling that there is no more room for growth or learning. That’s why I am constantly striving to develop new skills whenever I can.Trendy words/designs/clothes, etc. are exactly that: trends. They will, without a doubt, die out and look dated (Remember skeumorphic design). I try to avoid incorporating short-lived trends whenever I can in life and in my career.Sometimes, you can get caught up trying to get more likes or favorites or whatever it may be, by following trends. I see tons of concepts with text or buttons overflowing past the background a random distance. Or I see a title that fits perfectly with the image designers chose but if any other image was used, the same layout would never work. Yet these shots have hundreds of likes…Disclaimer: I understand dribbble and other sites like it are meant to somewhat of a creative release for people. Therefore some of the work is strictly for fun and was never meant to be used in the real world. I’m not saying trying new things and exploring new styles is bad — but it’s not practical.My suggestion is to not get sucked into this. If your design helps people use your product or understand what to do and only gets 5 likes, it’s still a great design.On a semi-related note, I’ve conducted a number of interviews lately and I’ve picked up on many things throughout the process of trying to hire a fellow designer. Every time a candidate interviews with us and answers questions in buzzword after buzzword, the general consensus is they can’t communicate their reasoning and thoughts very well for why they made certain design decisions.First off, shame on you if you scrolled down to this point without reading anything else. Secondly, here are the key takeaways you should remember from the article.If you enjoyed this article hit that heart ❤️ and share it with the world 👍Thanks for taking the time to read this article, if you have any comments about it I would love to hear what you think.You can also check out my other article I wrote.Thanks to Hayley Parke and Ali Torbati for helping me make my thoughts make more sense.Landing a job is hard work. While it’s impossible to know (beforehand) the answer to every question that an interviewer asks you, there are a few common questions that you can prepare for. Nailing the answers to these won’t guarantee you a job, but they will improve your chances of success. Just remember to tailor them to each individual interview based on the job description and company.Below is my list of seven fundamental UX interview questions, along with tips and tricks on how to answer them.Even though this is a fairly general question, don’t provide general answers. Focus on giving a specific definition that sheds light on who you are as a designer. Your explanation should be clear and accessible. (Imagine that you’re explaining it to a 10-year-old).For the “why does this matter” question, use it as an opportunity to showcase your passion for the company’s approach to design. You can also use it to tell a story that provides context for your own design perspective and focuses on the importance of human-centered experiences.When answering the “How would you explain the UX design process?“ question, focus on each of the following areas:Tip: Focus your definition of UX design around empathy and the importance of understanding the people you are designing for. This usually means that as a UX designer you should strive to design surveys and interview users to harness data.When explaining your design process, you can either describe your potential approach to a typical project (good), or you can explain how you’ve done it in the past on other projects (better). Walk your interviewer through your project(s) by using stories:Don’t be afraid if your process isn’t the same as that of other designers. What does matter is your ability to explain the rationale behind your approach.Tip: It’s a good idea to talk about a user-centered approach to design, which follows a thorough understanding of both user and business goals. But it’s more powerful to mention it in context of a specific project.You’ll probably want to touch on each of the following techniques in context of your project(s):Your interviewer wants to get a sense of your working style. Design is a team sport and, as a UX designer, it’s crucial that you know how to effectively communicate design decisions with the team from the beginning of the project right through to implementation.Keep in mind that each team member probably sees a given project through different contextual lenses, but you need be able to communicate with all of them to quickly spot any problems or misunderstandings.The ability to empathize and understand the motivations of those around you is crucial. Developers, PMs, and other designers will all come with their own particular needs and goals, and if you can demonstrate that you’re listening to all of them, you’ll be well received:Tip: When responding to this question, ask your interviewer to describe the current team structure, roles, and existing processes. Ask for any issues they’re currently facing. You can frame your experience in terms of solving their problems. Let the interviewer see how passionate you are about bringing your skills and experience not just to the position but to the company itself.This is a really hard question to answer because it is very dependent on context. If the question is asked in context of building a new piece of software, you can talk about how an MVP (minimum viable product) could be developed.If the question is asked in context of an existing product, you should focus on the fundamentals of product strategy. Before drilling down on specific features, you will need to develop a clear picture of the business goals and user needs. You should be ready to answer the following questions:Tip: This is also a great time to show how you would use user research to validate design decisions. Often, when faced with a challenge, gathering a lot of user-generated data can help move a designer forward. Once enough data has been collected and the user’s goals have been validated, you can determine which new features are best aligned with business goals, and ultimately, how the features will be prioritized.This is a tricky question because it puts candidates at ease, which, in turn lets the interviewer ask follow-up questions that dig into process, thinking, and interactions with other team members. It allows the interviewer to assess the candidate’s depth and skill without directly asking about it. As a result, it’s best to keep your answer truthful and clear. Don’t exaggerate your contribution to a project.Tip: Note that the question here doesn’t contain the word “UX.” It’s perfectly OK to step into the wider realms of your life in your answer.First things first, do not pretend that you’ve never had such a project. Making mistakes is a normal part of work life. What’s critical is how you handle them. You need to find an honest example that shows:Tip: The key is to acknowledge your weakness and then offer a reason that you could turn it into a strength. We all learn from our mistakes.Use this question as an opportunity to demonstrate your passion for UX design and its future potential. Here are a couple of topics you could focus on: The rise of new prototyping tools that save developers and designers time by converting design to code. Designing for accessibility that allows users of all abilities to navigate, understand, and use your UI successfully.Tip: This question is also a great opportunity to talk about use cases beyond screens (i.e. Virtual reality/Augmented reality).Talk about the blogs and books you read, the conferences you’ve attended, and industry leaders that you follow.A list of my favorite blogs in the industry (in no particular order):My list of people to follow:And here is a recommended reading list for anyone who wants to learn or deepen their knowledge in UX:You might be wondering why this list doesn’t include the ubiquitous “Why should I hire you?” question. It’s because I don’t have a guide for how to answer it. You have to figure it out for yourself. The only thing I would say is: Be honest with yourself. Have a clear idea of why you’d want to work for the company, because, ultimately, your enthusiasm (or lack of it) will come through.One last thing: Don’t script your responses — you’ll just end up sounding inauthentic. Instead have some key headlines (the things you want to talk about) in mind before you start answering questions.Good luck and let me know how you got on in the comments below!Springboard prepares you for the careers of tomorrow with its mentor-led online courses. Some courses even come with a job guarantee! Find out more.Nick Babich is a developer, tech enthusiast, and UX lover. He has spent the last 10 years in the software industry with a specialized focus on development."
  },
  {
    "link": "https://medium.com/ux-power-tools/blockframing-and-31-free-sketch-ready-layouts-using-auto-layout-by-anima-app-1be039007ecf?source=---------4-----------",
    "pic": "https://cdn-images-1.medium.com/fit/c/36/36/1*zQFQCr5DHUjH7a5Ym1E42g.jpeg",
    "author": "",
    "date": "Mar 19",
    "photo": "https://cdn-images-1.medium.com/max/800/1*F0xDGAMZDE6Y2kqJWzchmQ.png",
    "head": "“Blockframing” and 31 Free Sketch-Ready Layouts Using Auto Layout by Anima App ",
    "contents": "Your product’s success is based on a combination of factors, but the overall user experience tops them all. When it comes down to designing a new app or a site, sticking to best practices is a solid way to go, but during the creation of the big picture, it’s fairly easy to skimp over design elements that feel like nice to have but not necessary. However, the difference between good and bad experiences often comes down to how thoughtful we can design these small details.In this article, I’ll focus on visual feedback, microcopy and whitespace and you’ll see why these little big details are just as important as the more obvious elements of your design, and how they help determine the success of your product.Visual feedback might be easily overlooked in the greater design scheme, but it actually hold the entire experience together. When there’s no feedback there’s no proper interaction. Imagine talking to someone who doesn’t respond in any way — you can’t communicate at all. Same goes for your app.You must ensure that there is always some feedback for user actions, because it makes users feel in control. Visual feedbackIn real life, buttons, controls and objects respond to our interaction, and this is how people expect things to work. People expect a similar level of responsiveness from app elements.Visual feedback is also helpful when you need to inform users about results of an operation. You can use existing elements to deliver a feedback.Users want to know their current context in a system at any given time and apps shouldn’t keep them guessing — they should tell the user what’s happening via appropriate visual feedback. For frequent and minor actions, the response can be modest, while for infrequent and major actions, the response should be more substantial.Microcopy is the little bits of text that guide users through an experience. Microcopy examples are error messages, button labels, hint text. At a glance, these tiny clusters of words seem insignificant when compared to the overall app design. But surprisingly, they have a huge impact on conversions.A quick way to make your UI warmer and less mechanical is a human tone in the copy. If your product sounds human, it’s easier for people to trust you.How errors are communicated can have a huge impact on the way someone experiences your product. Often overlooked, an ill-constructed error message can fill users with frustration.A well-crafted error message, on the other hand, can turn a moment of frustration into a moment of delight. Thus, make error messages human, not technical, and suited to your audience.Microcopy is extremely contextual. That’s why it’s so valuable. It answers a very specific question people have and speaks to their concerns right on the spot. For example, microcopy can be fundamental in reassuring your users at the point of subscribing or sharing details. Whilst ‘not to spam/auto-tweet’ might be taken for granted by good marketers when asking for email address/access to the social network account connections, the user is less than sure. Thus, when people add their emails or connect their Twitter accounts, say “we hate spam as much as you do.”Whitespace (or negative space) is the areas of a design where there is no element placed by a designer. Elements of whitespace are space around images, margins, paddings, line-spacing and letter-spacing within text content. Although many may consider it a waste of valuable screen estate, whitespace is an essential element in user interface design.Clutter is bad. Cluttering your interface overloads your user with too much information: every added button, image, and line of text make the screen more complicated. If you don’t think any part of your design should be intentionally blank, take a look at example below and you’ll see what happens when too many objects competing for your attention.The power of white space comes from the limits of human attention and memory. Our short-term memory can hold a small amount of information (typically around 7 items or even less) in mind in an active, readily-available state for a short period of time (typically from 10 to 15 seconds, or sometimes up to a minute).If cluttering your interface overloads your user with too much information, then reducing the clutter will improve comprehension. Generous whitespace can make some of the messiest interfaces look inviting and simple. Whitespace reduces the amount of elements users see all at once and makes scanning much easier. The skill of using whitespace lies in providing your users with a digestible amount of content (chunks of content), then stripping away extraneous details.Whitespace creates the spaces around elements in the design to help them stand out or separate from the other elements. It helps communicate what’s most important and needs attention.Google Search homepage is a great example of using whitespace. The layout immediately facilitates the user goal by placing primary interaction element (search box) in front and center, with plenty of white space on either side to add emphasis.The law of proximity describes how the human eye perceives connections between visual elements. It states that objects near to each other appear similar. We can use whitespace to build perceived relationships between different elements. Take a look at this picture. Almost everyone sees two groups of dots, rather than simply 16 dots.Breaking the information up into appropriate groups can help make it feel more scannable and readable. In the form on the right, categorising the 15 fields into three groups makes the process feel easier. The amount of content is the same, but the impression on users is much different.Design with care. Each minor detail in your app’s UI deserves close attention because UX is the sum of all details working harmoniously:Thank you!Follow UX Planet: Twitter | FacebookOriginally published at babich.bizY ou sit in your car, listening to a light rain ping quietly down on the hood. You’ve just finished your fourth trip of the night, and you sit back and relax. Not for long though, it’s a busy night and you accept another pickup request close by. As navigation begins, you check your mirrors, shift into drive, and pull out onto the road towards a new destination. You work your way across a few lanes of heavy traffic to make that first left coming up. After more lights and turns, you arrive at a busy pickup point and look for a safe space to pull over. Out of the crowd on the sidewalk, a person waves and heads your way.You’re about to find out where you’re going next.On the driver team at Uber, one of our jobs is to take the pressure off of drivers, so that they can focus on smooth and stress-free rides for everybody. We want to make sure that drivers have the best features possible directly in-app, and one of the most important features is a navigation system. So we started with a basic question:If you’re browsing for a new restaurant for lunch, or trying to find a lecture hall on a college campus, you’ll have different mapping needs than if you’re in the mountains on a two-day hike. And, if you’re commuting to work on a familiar daily route, or driving to a friend’s birthday party, your navigation needs are different from people driving with Uber. Why are one-size-fits-all digital maps not a good fit for Uber?It all boils down to this:For most drivers in most situations, your trip is a simple one: you’ve got a starting point, a destination, and the best route between the two. The end.If you’re driving with Uber, however, it’s all about that magic moment where a car and a passenger meet. Then you travel together to a new destination, and when your passenger leaves your car, you’re off to the next meeting point. If you are a driver on an uberPool trip, your route might have several overlapping pickups and dropoffs. Throw deliveries into the mix — where you might need to park and walk inside for a pickup — and navigation can get incredibly complicated.When it came to something as central as navigation, we knew how important it was to get things right. Uber is able to move fast with features, but for the navigation overhaul, our pace was much more deliberate.Committing to the long haul meant that we could dive deeply into the needs of drivers. We conducted driver interviews. We rode along with them to watch and listen to their pain points. We held in-office forums and gathered map and navigation related feedback. We shared prototypes, observed drivers interacting with them, and listened to their likes and dislikes. We set up an eye-tracking rig and analyzed how a driver’s eyes interact with the environment vs. a device screen. We built a car simulator in our office, which we connected to a gaming wheel controller, a video of typical driving scenarios, and a timed navigation prototype. We even built a physical map of Amsterdam out of paper.But we didn’t stop there. We sent our team across the US and all over the world with navigation prototypes and cameras to see what would happen when rubber met the road.It’s hard to overstate how valuable this first-person testing was. We understood that we needed a mapping + navigation tool that would be as useful over the canals of Amsterdam and through the tunnels of Boston as it would in the jammed streets of Jakarta or the one-way avenues of NYC. Day or night, uberX or uberPOOL, it needed to serve the unique needs of drivers.Unlike traditional navigation apps, Uber Navigation has to help its users answer the question “What’s next?”. Once a driver successfully completes one trip, it’s important that navigation is ready with the best route for the next trip.Uber Navigation also needs to differentiate between types of locations and activities, so we designed distinct visuals for the variety of actions a driver might take on different legs of a trip. Custom cartography, maneuver iconography, pins, side-of-street-indicators, route line previews, and camera animations all work together to explain the journey.Take the “3-Foot-1-Second” Rule: drivers are looking at a smartphone-sized screen from about three feet away, for about one second at a time. This means that “glanceability” and “tappability” are priorities. Designing the new navigation experience was all about answering the question “what is the essential information that the user needs right now?” Everything else had to take a backseat.For gestures, we wanted drivers to have freedom, but also minimal need to interact while driving. We do enable a driver to pan and zoom if they choose, but we also made sure to build in an effortless single tap gesture to toggle between an overview state and a first person navigation, or to inspect the destination point.One of our essential new navigation features is Night Mode. Many people drive with Uber at night, and sometimes for hours at a time. The default day settings can cause eye-strain as a driver readjusts from the bright screen to the dark streets outside. Night Mode protects drivers from light pollution that would otherwise be a real ergonomic and safety hazard.For Night Mode, we wanted a subdued color palette. Designers sat in a windowless, dark room and analyzed multiple color schemes. We were amazed by how different they looked in an unlit room compared to a normal bright conference room. We took our favorite options out on night-time drive tests, and from there we pushed and pulled values until the guidance UI, map UI, and map styles all felt harmonious.Uber Navigation is custom tailored for drivers, and we’re not done yet. Every day we’re collecting great constructive feedback from drivers, and we’ll be prioritizing their feedback in upcoming versions. Plus, now that we’ve rolled out our starting lineup, we’re excited for all of the design possibilities to come.We are so proud of everyone who made this happen. And while this post is design-focused, we want to recognize over a year of hard work by designers, engineers, researchers, and product managers. Most of all, we’d like to thank the drivers for their invaluable feedback. Thank you!Are you a map design enthusiast, routing wonk, driver? Have any thoughts about the new navigation? Let us know what you think in the comments below!ByEvelyn KimCady WachsmanChristine TaoBo Paweena AttayadmawittayaMap data source © TomTomThroughout life, you hear the cheesy saying, “quality over quantity.” In most situations this is good advice. Not in the design world.To be clear, this isn’t an excuse to show 10 half-assed designs. This means, instead of showing one design you believe to be perfect, show 3 great ideas. The ampersand in the title of this section is important — we’re trying to strike a balance and deliver on both.Time for a real-world example: Most projects start with a list of product requirements. The people who come up with the requirements usually have an idea of how they believe the product should look (whether they tell you or not). Quantity and quality comes into play when there are differing opinions about implementation. The best way to keep the project moving is to show at least two examples:Even if you know option 1 won’t work in your head, showing the initial design is critical. Stakeholders won’t be satisfied until they can actually see its shortcomings. Usually a mashup of the two concepts will be the final outcome, but that’s better than executing a design you disagree with.You could have the world’s best design, but if you don’t know how to explain the problem being addressed and the reason for your design decisions, the design will never get approved. Context is king when it comes to pitching your idea or concept to others.There are two easy steps that will help you give a great presentation:If all you do is show your final design without providing context, people may not understand how you arrived at your conclusion and ask you to explore various other approaches. At that point, defending your work and pointing out the flaws in their suggestions might sound more defensive than you would like.This is something that is very important to me and a major part of being in a creative profession. I always make it a priority to learn new skills (software, leadership, dev languages, etc.) — whatever I need to continue to grow as a designer.I don’t buy the excuse that people are too busy to learn, because almost everyone has some free time at some point in the day. It comes down to what you do in that free time.At my first job I learned how to write html, css and some basic js and became a “developer.” When I took my second job I learned how to make illustrations and add animations to my designs. At my current job, I’m learning how to communicate my thoughts more clearly and build prototypes to better demonstrate my designs.I never want to get to a point in my career or life, when I have the feeling that there is no more room for growth or learning. That’s why I am constantly striving to develop new skills whenever I can.Trendy words/designs/clothes, etc. are exactly that: trends. They will, without a doubt, die out and look dated (Remember skeumorphic design). I try to avoid incorporating short-lived trends whenever I can in life and in my career.Sometimes, you can get caught up trying to get more likes or favorites or whatever it may be, by following trends. I see tons of concepts with text or buttons overflowing past the background a random distance. Or I see a title that fits perfectly with the image designers chose but if any other image was used, the same layout would never work. Yet these shots have hundreds of likes…Disclaimer: I understand dribbble and other sites like it are meant to somewhat of a creative release for people. Therefore some of the work is strictly for fun and was never meant to be used in the real world. I’m not saying trying new things and exploring new styles is bad — but it’s not practical.My suggestion is to not get sucked into this. If your design helps people use your product or understand what to do and only gets 5 likes, it’s still a great design.On a semi-related note, I’ve conducted a number of interviews lately and I’ve picked up on many things throughout the process of trying to hire a fellow designer. Every time a candidate interviews with us and answers questions in buzzword after buzzword, the general consensus is they can’t communicate their reasoning and thoughts very well for why they made certain design decisions.First off, shame on you if you scrolled down to this point without reading anything else. Secondly, here are the key takeaways you should remember from the article.If you enjoyed this article hit that heart ❤️ and share it with the world 👍Thanks for taking the time to read this article, if you have any comments about it I would love to hear what you think.You can also check out my other article I wrote.Thanks to Hayley Parke and Ali Torbati for helping me make my thoughts make more sense.Landing a job is hard work. While it’s impossible to know (beforehand) the answer to every question that an interviewer asks you, there are a few common questions that you can prepare for. Nailing the answers to these won’t guarantee you a job, but they will improve your chances of success. Just remember to tailor them to each individual interview based on the job description and company.Below is my list of seven fundamental UX interview questions, along with tips and tricks on how to answer them.Even though this is a fairly general question, don’t provide general answers. Focus on giving a specific definition that sheds light on who you are as a designer. Your explanation should be clear and accessible. (Imagine that you’re explaining it to a 10-year-old).For the “why does this matter” question, use it as an opportunity to showcase your passion for the company’s approach to design. You can also use it to tell a story that provides context for your own design perspective and focuses on the importance of human-centered experiences.When answering the “How would you explain the UX design process?“ question, focus on each of the following areas:Tip: Focus your definition of UX design around empathy and the importance of understanding the people you are designing for. This usually means that as a UX designer you should strive to design surveys and interview users to harness data.When explaining your design process, you can either describe your potential approach to a typical project (good), or you can explain how you’ve done it in the past on other projects (better). Walk your interviewer through your project(s) by using stories:Don’t be afraid if your process isn’t the same as that of other designers. What does matter is your ability to explain the rationale behind your approach.Tip: It’s a good idea to talk about a user-centered approach to design, which follows a thorough understanding of both user and business goals. But it’s more powerful to mention it in context of a specific project.You’ll probably want to touch on each of the following techniques in context of your project(s):Your interviewer wants to get a sense of your working style. Design is a team sport and, as a UX designer, it’s crucial that you know how to effectively communicate design decisions with the team from the beginning of the project right through to implementation.Keep in mind that each team member probably sees a given project through different contextual lenses, but you need be able to communicate with all of them to quickly spot any problems or misunderstandings.The ability to empathize and understand the motivations of those around you is crucial. Developers, PMs, and other designers will all come with their own particular needs and goals, and if you can demonstrate that you’re listening to all of them, you’ll be well received:Tip: When responding to this question, ask your interviewer to describe the current team structure, roles, and existing processes. Ask for any issues they’re currently facing. You can frame your experience in terms of solving their problems. Let the interviewer see how passionate you are about bringing your skills and experience not just to the position but to the company itself.This is a really hard question to answer because it is very dependent on context. If the question is asked in context of building a new piece of software, you can talk about how an MVP (minimum viable product) could be developed.If the question is asked in context of an existing product, you should focus on the fundamentals of product strategy. Before drilling down on specific features, you will need to develop a clear picture of the business goals and user needs. You should be ready to answer the following questions:Tip: This is also a great time to show how you would use user research to validate design decisions. Often, when faced with a challenge, gathering a lot of user-generated data can help move a designer forward. Once enough data has been collected and the user’s goals have been validated, you can determine which new features are best aligned with business goals, and ultimately, how the features will be prioritized.This is a tricky question because it puts candidates at ease, which, in turn lets the interviewer ask follow-up questions that dig into process, thinking, and interactions with other team members. It allows the interviewer to assess the candidate’s depth and skill without directly asking about it. As a result, it’s best to keep your answer truthful and clear. Don’t exaggerate your contribution to a project.Tip: Note that the question here doesn’t contain the word “UX.” It’s perfectly OK to step into the wider realms of your life in your answer.First things first, do not pretend that you’ve never had such a project. Making mistakes is a normal part of work life. What’s critical is how you handle them. You need to find an honest example that shows:Tip: The key is to acknowledge your weakness and then offer a reason that you could turn it into a strength. We all learn from our mistakes.Use this question as an opportunity to demonstrate your passion for UX design and its future potential. Here are a couple of topics you could focus on: The rise of new prototyping tools that save developers and designers time by converting design to code. Designing for accessibility that allows users of all abilities to navigate, understand, and use your UI successfully.Tip: This question is also a great opportunity to talk about use cases beyond screens (i.e. Virtual reality/Augmented reality).Talk about the blogs and books you read, the conferences you’ve attended, and industry leaders that you follow.A list of my favorite blogs in the industry (in no particular order):My list of people to follow:And here is a recommended reading list for anyone who wants to learn or deepen their knowledge in UX:You might be wondering why this list doesn’t include the ubiquitous “Why should I hire you?” question. It’s because I don’t have a guide for how to answer it. You have to figure it out for yourself. The only thing I would say is: Be honest with yourself. Have a clear idea of why you’d want to work for the company, because, ultimately, your enthusiasm (or lack of it) will come through.One last thing: Don’t script your responses — you’ll just end up sounding inauthentic. Instead have some key headlines (the things you want to talk about) in mind before you start answering questions.Good luck and let me know how you got on in the comments below!Springboard prepares you for the careers of tomorrow with its mentor-led online courses. Some courses even come with a job guarantee! Find out more.Nick Babich is a developer, tech enthusiast, and UX lover. He has spent the last 10 years in the software industry with a specialized focus on development.The only time I ever create “real” wireframes is when I’m trying to show a cool process shot on Dribbble……and I never show cool process shots on Dribbble.You guys, I’m just not good at wireframes!I always get excited and end up adding way too much detail, and what was supposed to be a quick wireframe ends up being six hours of nitpixeling™ for perfect padding, magnificent margins, and textbook typography.So no…I’m not really that good at wireframes.But what I AM good at is blockframing.My design mentor told me a story about a professor he had in school who used to take his glasses off when he assessed their designs. He said it helped him get a better sense of the layout and visual harmony of their designs.Truth is, you can tell a pretty compelling story with this blurry mockup. It’s a quick way to vet a design without needing to design all that much.By identifying the largest regions of color above, here’s Facebook represented as a blockframe:With the amazing Auto Layout plugin by Anima App, I can even show you how the page content should behave when the browser is resized…what’s fixed…what’s fluid…and what’s floating:The advantage to blockframing is that you can do it during every phase of the product design process:Blockframing does not replace conventional wireframing. Wireframing just doesn’t fit into my workflow. My design team does so much collaboration on the whiteboard with the client that anything more than that is, for me, a waste of time.I personally find detailed wireframes with dummy text, one-pixel borders, and “X” placeholder images to be distracting. And if I find them distracting (as someone who knows how to read them), then the client might too.Using a blockframe, I describe entire areas of content instead of getting caught up in the details. This equips me with more than enough information to convey an idea or begin to tell a story.I’ll usually send something like this to the client over Slack or email to quickly vet an idea for a new screen. We talk about the different areas, move things around, and start playing with color and contrast. It’s a great way to be agile and flexible with the design before diving into high-fidelity, and clients are always thrilled to be part of the process.This also saves time because the client won’t be splitting hairs over every little detail on the page. In my experience, blockframing with the client or stakeholder dramatically increases your success rate when showing off the final design(s) because the client already knows what’s coming.Let’s say you’ve already shipped the product and you’re on to designing new features. By this point, there are dozens of well-established patterns, and the visual style is very well defined. You might even have a full-blown design framework like UX Power Tools in place! 😉I find blockframing particularly useful during this phase because I can create something that will look much closer to the real design. The colors I use end up being pretty close (if not identical) to the ones in the final design.Here are a couple familiar apps that only took a few minutes to blockframe:I might do some light wireframing in addition to the blockframes shown above, but I’m otherwise ready to start designing in high-fidelity.Again, by this point in the process (mid-design), I’ve already designed a bunch of screens and have lots of design patterns in place, so this is plenty of prep for me to get started. And chances are I’ll just end up using these containers in the real design instead of throwing things away like I [often] do when I wireframe.At my agency, were always adjusting our client presentation techniques so that we’re showing off our work in the best way possible. After thousands of presentations, design reviews, and concept reveals with CEOs, investors, and heads of product, we’ve gotten pretty good at telling the right story in the right way, at the right time.Once we finish a design, we create a blockframe directly on top of it so that we can slowly reveal different sections of the design. In our experience, showing the whole design all at once is SUPER OVERWHELMING for the client, and they’ll start asking all kinds of questions that you’re not ready for.By blockframing over the UI, we’re essentially uncovering one dish at a time, as if we’re hosting a Victorian-era dinner party for our bourgeoise friends:Here’s how we would present YouTube:After doing a quick recap of the page regions, then we will start revealing the UI, section-by-section:We only show one section at a time. This helps us target the client’s attention to the one place we want them to focus:Let’s keep moving. Now we’re onto the video details. In this particular example, the page is pretty short. In a real scenario, we’d probably have a longer page to show off the comments section.Finally, we reach the “Related Videos” and section. In a conversation with a client, we’d probably talk about how this list is populated, and how suggested videos like these will help to lead users into a BLACKHOLE OF YOUTUBE VIDEOS FOR THE NEXT FIVE HOURS.Not that that’s ever happened to me…Only after we’ve finished revealing each section will we show off the whole interface:The client has been primed, and their eyes will instinctively compartmentalize each region of the page. They now have a perfect understanding of what each area of the page is for, and conversations from here on out will be much more productive. Clients will ask better questions, provide better feedback, and present the design (by themselves) to external stakeholders much more intelligently than before.Alright, alright.Auto Layout is an awesome tool, and their new “stacks” feature emulates CSS flexbox behaviors right inside of Sketch.It’s dope.You can get all 30+ layouts FUH FREE right down yonder. It will cost you zero dollars unless you want to fund a Chipotle burrito ¯\\_(ツ)_/¯(Related: Did you know there was a burrito emoji? It’s wildly detailed.)Okay but for real this time, here’s the file:Lastly, I recently updated UX Power Tools to work with Auto Layout so now it’s even faster to use! I think you’ll dig it. If you’re interested, you can get that below, or you can read more about it here.When I’m not writing, I’m working on Sketch design tools like UX Power Tools to make you a better, more efficient designer. All the best Sketch designers and teams are using it, and I think you might like it, too. Check it out on Marvel!Follow UX Power Tools on TwitterFollow me on Twitter"
  }
]